# Pandas series creation

In [2]:
import pandas as pd #Iannanshirley1955@gmail.com,cowgirl36
X = pd.Series([10,20,30,40])
X

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
print(X.index,X.values,sep="\n\n")

RangeIndex(start=0, stop=4, step=1)

[10 20 30 40]

In [10]:
#accessing the values
print(X[0],X[[1,2,3]],X[1:3],sep="\n\n")

10

1    20
2    30
3    40
dtype: int64

1    20
2    30
dtype: int64

# pandas series creation with index values

In [14]:
X = pd.Series([10,20,30,40], index = ['a','b','c','d'])
X

a    10
b    20
c    30
d    40
dtype: int64

In [15]:
print(X.index,X.values,sep='\n\n')

Index(['a', 'b', 'c', 'd'], dtype='object')

[10 20 30 40]

In [18]:
print(X['a'],X[['b','c','d']],X['b':'d'],sep='\n\n')

10

b    20
c    30
d    40
dtype: int64

b    20
c    30
d    40
dtype: int64

# Filter operation

In [2]:
import pandas as pd
X = pd.Series([10,-10,20,-20,30,-30,40,-40])
X

0    10
1   -10
2    20
3   -20
4    30
5   -30
6    40
7   -40
dtype: int64

In [3]:
X < 0

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7     True
dtype: bool

In [5]:
print(X[X<0],X[X>20],X[X>0],sep="\n\n")

1   -10
3   -20
5   -30
7   -40
dtype: int64

4    30
6    40
dtype: int64

0    10
2    20
4    30
6    40
dtype: int64

# Mathematical operation on series object

In [6]:
X1 = pd.Series([10,20,30,40], index = ['a','b','c','d'])
X2 = pd.Series([20,30,40,50], index = ['b','c','d','e'])

X1 + X2 # it depends on thr indeX and NAN = Not a number

a     NaN
b    40.0
c    60.0
d    80.0
e     NaN
dtype: float64

In [7]:
X1 + X1

a    20
b    40
c    60
d    80
dtype: int64

# Pandas series object creation using dictionary

In [8]:
D = {'a' :1,'b' :2 ,'c':3,'d':4}
X = pd.Series(D)
X

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
# changing the order of object inside pandas series
X = pd.Series(D,index = ['d','c','b','a'])
X

d    4
c    3
b    2
a    1
dtype: int64

In [10]:
# creating a series that has a missing value i.e NAn
X = pd.Series(D,index = ['d','c','b','a','e'])
X

d    4.0
c    3.0
b    2.0
a    1.0
e    NaN
dtype: float64

In [11]:
# checking for null values or not
X.isnull()

d    False
c    False
b    False
a    False
e     True
dtype: bool

In [12]:
X.notnull()

d     True
c     True
b     True
a     True
e    False
dtype: bool

In [27]:
import numpy as np
import pandas as pd
X= pd.Series([10,20,30,40,50,60],index = ['a','b','c','d','e','f'])
Y= pd.Series([10,20,30,40,50,60],index = ['b','c','d','e','f','j'])
print(X-Y)

a     NaN
b    10.0
c    10.0
d    10.0
e    10.0
f    10.0
j     NaN
dtype: float64

In [31]:
X = pd.Series({'a':1,'b':2,'c':3},index = ['c','b','a'])
X

c    3
b    2
a    1
dtype: int64

# pandas dataframe

In [7]:
import pandas as pd
D = {"State":['AP',"HP","UP","kA"],
     "Size" :[10,20,30,40],
     "Year" :[2001,2002,2003,2004]
    }
X=pd.DataFrame(D)
X

  State  Size  Year
0    AP    10  2001
1    HP    20  2002
2    UP    30  2003
3    kA    40  2004

In [7]:
X = pd.DataFrame(D, columns = ["State","Size"])
X

  State  Size
0    AP    10
1    HP    20
2    UP    30
3    kA    40

In [9]:
# changing the order of the table
X = pd.DataFrame(D, columns = ["Year","State","Size"])
X

   Year State  Size
0  2001    AP    10
1  2002    HP    20
2  2003    UP    30
3  2004    kA    40

In [10]:
# insertng a column that is not created
X = pd.DataFrame(D, columns = ["Year","State","Size","Population"])
X

   Year State  Size Population
0  2001    AP    10        NaN
1  2002    HP    20        NaN
2  2003    UP    30        NaN
3  2004    kA    40        NaN

# Accessing Column Details

In [13]:
X = pd.DataFrame(D, columns = ["Year","State","Size","Population"])
X

   Year State  Size Population
0  2001    AP    10        NaN
1  2002    HP    20        NaN
2  2003    UP    30        NaN
3  2004    kA    40        NaN

In [14]:
print(X["Year"],X.Year,sep ="\n\n")

0    2001
1    2002
2    2003
3    2004
Name: Year, dtype: int64

0    2001
1    2002
2    2003
3    2004
Name: Year, dtype: int64

In [18]:
# accessing more than one column
print(X[["Year","State","Size"]],sep = '\n\n')

   Year State  Size
0  2001    AP    10
1  2002    HP    20
2  2003    UP    30
3  2004    kA    40

In [19]:
X.columns

Index(['Year', 'State', 'Size', 'Population'], dtype='object')

In [21]:
# assigning one value
X["Population"] = 10
X

   Year State  Size  Population
0  2001    AP    10          10
1  2002    HP    20          10
2  2003    UP    30          10
3  2004    kA    40          10

In [22]:
# assigning more than one value
X["Population"] = [10,100,200,300]
X

   Year State  Size  Population
0  2001    AP    10          10
1  2002    HP    20         100
2  2003    UP    30         200
3  2004    kA    40         300

#  Column Update,delete,transpose,Nested dictionary pandas dataframe

In [8]:
import pandas as pd
# creating a boolean value based on a column in the dataframe
X['Size>20'] = X['Size'] > 20
X

  State  Size  Year  Size>20
0    AP    10  2001    False
1    HP    20  2002    False
2    UP    30  2003     True
3    kA    40  2004     True

In [9]:
X = pd.DataFrame(D, columns = ["Year","State","Size","Population"])
X

   Year State  Size Population
0  2001    AP    10        NaN
1  2002    HP    20        NaN
2  2003    UP    30        NaN
3  2004    kA    40        NaN

In [21]:
# updating a column in the dataframe
Xpop = pd.Series ([100,200,300,400])
Xpop

0    100
1    200
2    300
3    400
dtype: int64

In [22]:
X["Population"] = Xpop
X

   Year State  Size  Population
0  2001    AP    10         100
1  2002    HP    20         200
2  2003    UP    30         300
3  2004    kA    40         400

In [23]:
# transposing a dataframe
X.T # or we use X.transpose()

               0     1     2     3
Year        2001  2002  2003  2004
State         AP    HP    UP    kA
Size          10    20    30    40
Population   100   200   300   400

In [24]:
# deleting a column
X

   Year State  Size  Population
0  2001    AP    10         100
1  2002    HP    20         200
2  2003    UP    30         300
3  2004    kA    40         400

In [ ]:
del X["Population"]

In [36]:
X

   Year State  Size
0  2001    AP    10
1  2002    HP    20
2  2003    UP    30
3  2004    kA    40

In [ ]:
# check your book for nested dictionary dataframe creation

# properties of index object(can be repeated,immutable)

In [39]:
X = pd.DataFrame(D,columns=["Year","State","Size","Population"], index = ['a','b','c','d'])
X

   Year State  Size Population
a  2001    AP    10        NaN
b  2002    HP    20        NaN
c  2003    UP    30        NaN
d  2004    kA    40        NaN

In [40]:
#accessing Columns and rows 
print(X.index,X.columns,sep = "\n\n")

Index(['a', 'b', 'c', 'd'], dtype='object')

Index(['Year', 'State', 'Size', 'Population'], dtype='object')

In [41]:
# index object can be repeated
X = pd.DataFrame(D,columns=["Year","State","Size","Population"], index = ['a','a','b','b'])
X

   Year State  Size Population
a  2001    AP    10        NaN
a  2002    HP    20        NaN
b  2003    UP    30        NaN
b  2004    kA    40        NaN

In [43]:
# index objects are immutable
X.index[0] = 'b'

TypeError: Index does not support mutable operations

In [46]:
# column index is also immutable
X.columns[0] = "col"

TypeError: Index does not support mutable operations

# Reindexing(series,Dataframe-row/column)

In [47]:
# reindexing series
X = pd.Series([10,20,30,40], index = ['a','b','c','d'])
X

a    10
b    20
c    30
d    40
dtype: int64

In [48]:
# no replacement made
X.reindex(['b','c','d','e','f'])

b    20.0
c    30.0
d    40.0
e     NaN
f     NaN
dtype: float64

In [49]:
X

a    10
b    20
c    30
d    40
dtype: int64

In [52]:
# reindexing Dataframes
X = pd.DataFrame(D,columns=["Year","State","Size","Population"], index = ['a','b','c','d'])
X

   Year State  Size Population
a  2001    AP    10        NaN
b  2002    HP    20        NaN
c  2003    UP    30        NaN
d  2004    kA    40        NaN

In [53]:
X1 = X.reindex(['b','c','d','e','f'])
X1

     Year State  Size Population
b  2002.0    HP  20.0        NaN
c  2003.0    UP  30.0        NaN
d  2004.0    kA  40.0        NaN
e     NaN   NaN   NaN        NaN
f     NaN   NaN   NaN        NaN

In [54]:
# reindexing colums
X2 = X.reindex(columns = ['Year','State',"Col1",'Col2'])
X2

   Year State  Col1  Col2
a  2001    AP   NaN   NaN
b  2002    HP   NaN   NaN
c  2003    UP   NaN   NaN
d  2004    kA   NaN   NaN

In [55]:
# dropping index

# dropping series
X = pd.Series([10,20,30,40], index = ['a','b','c','d'])
X

a    10
b    20
c    30
d    40
dtype: int64

In [58]:
# dropping multiple rows 
X.drop(['a','b'])

c    30
d    40
dtype: int64

In [59]:
# droping one row
X.drop('a')

b    20
c    30
d    40
dtype: int64

In [60]:
# dropping in dataframes
X = pd.DataFrame(D,columns=["Year","State","Size","Population"], index = ['a','b','c','d'])
X

   Year State  Size Population
a  2001    AP    10        NaN
b  2002    HP    20        NaN
c  2003    UP    30        NaN
d  2004    kA    40        NaN

In [61]:
# dropping rows
X.drop(['a','b'])

   Year State  Size Population
c  2003    UP    30        NaN
d  2004    kA    40        NaN

In [62]:
# dropping columns
X.drop(columns = ['Year','State'])

   Size Population
a    10        NaN
b    20        NaN
c    30        NaN
d    40        NaN

In [63]:
X

   Year State  Size Population
a  2001    AP    10        NaN
b  2002    HP    20        NaN
c  2003    UP    30        NaN
d  2004    kA    40        NaN

In [64]:
# using inplace changes,it drops any values you dropped and creates a new change
X.drop(columns = ['Year','State'],inplace = True)

In [65]:
X

   Size Population
a    10        NaN
b    20        NaN
c    30        NaN
d    40        NaN

# Indexing,selection & Filtering

In [3]:
import pandas as pd
X = pd.Series([10,20,30,40,50], index = ['a','b','c','d','e'])
X

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
print(X['a'],X[0],X['d'],X[3],sep = ",")

10,10,40,40

In [6]:
# using slicing operator
print(X['a':'d'],X[0:4],sep = '\n\n')

a    10
b    20
c    30
d    40
dtype: int64

a    10
b    20
c    30
d    40
dtype: int64

In [8]:
print(X,X>20,X[X>20],sep ='\n\n')

a    10
b    20
c    30
d    40
e    50
dtype: int64

a    False
b    False
c     True
d     True
e     True
dtype: bool

c    30
d    40
e    50
dtype: int64

In [11]:
X[X>20] = 99
X

a    10
b    20
c    99
d    99
e    99
dtype: int64

In [12]:
X['c':'e']= 199
X

a     10
b     20
c    199
d    199
e    199
dtype: int64

In [18]:
import numpy as np
#using dataframes
X = pd.DataFrame(np.arange(15).reshape(5,3),index = ['a','b','c','d','e'],columns = ['col1','col2','col3'])
X

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11
e    12    13    14

In [23]:
## accessing the row values using positionvalues and numbers
print(X['col1'],X.loc['a'],X.iloc[4],sep = '\n\n')

a     0
b     3
c     6
d     9
e    12
Name: col1, dtype: int32

col1    0
col2    1
col3    2
Name: a, dtype: int32

col1    12
col2    13
col3    14
Name: e, dtype: int32

In [24]:
print(X.loc['a':'c','col1':'col2'],X.iloc[0:3,0:2],sep = '\n\n')

   col1  col2
a     0     1
b     3     4
c     6     7

   col1  col2
a     0     1
b     3     4
c     6     7

In [26]:
#passing multiple rows and columns in a list
print(X.loc[['a','c'],['col1','col2']],X.iloc[[0,3],[0,2]],sep = '\n\n')

   col1  col2
a     0     1
c     6     7

   col1  col3
a     0     2
d     9    11

In [27]:
X

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11
e    12    13    14

In [28]:
# using comparison operator
X[X['col3']>5]

   col1  col2  col3
c     6     7     8
d     9    10    11
e    12    13    14

In [29]:
# using the at command
X

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11
e    12    13    14

In [30]:
X.at["b",'col3']

5

In [31]:
# you cant access multiple numbers when using the at operator
X.iat[1,2]

5

# Hierarchial indexing

In [32]:
X = pd.DataFrame(np.arange(15).reshape(5,3),index = ['a','b','c','d','e'],columns = ['col1','col2','col3'])
X

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11
e    12    13    14

In [34]:
X.loc[:'d',:][X.col3>4]

C:\Users\GBENGA\AppData\Local\Temp\ipykernel_11728\4193906094.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  X.loc[:'d',:][X.col3>4]

   col1  col2  col3
b     3     4     5
c     6     7     8
d     9    10    11

In [35]:
X.loc[:'d',:][X.col3>4][X.col2>4]

C:\Users\GBENGA\AppData\Local\Temp\ipykernel_11728\2055341981.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  X.loc[:'d',:][X.col3>4][X.col2>4]

   col1  col2  col3
c     6     7     8
d     9    10    11

# negative indexing

In [36]:
#note use the loc and iloc when using negative indexing

# Arithemetic operation & fill_value function

In [3]:
import pandas as pd
X1 = pd.Series([10,20,30],index =['a','b','c'])
X2 = pd.Series([10,20,30],index =['b','c','d'])

X1 + X2

a     NaN
b    30.0
c    50.0
d     NaN
dtype: float64

In [4]:
#using the add function
X1.add(X2,fill_value = 200)

a    210.0
b     30.0
c     50.0
d    230.0
dtype: float64

In [9]:
import numpy as np
X1 = pd.DataFrame(np.arange(12).reshape(3,4),index =['a','b','c'],columns = ['col1','col2','col3','col4'])
X2 = pd.DataFrame(np.arange(12).reshape(3,4),index =['b','c','d'],columns = ['col2','col3','col4','col5'])

print(X1,X2,X1 + X2,sep='\n\n')

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11

   col2  col3  col4  col5
b     0     1     2     3
c     4     5     6     7
d     8     9    10    11

   col1  col2  col3  col4  col5
a   NaN   NaN   NaN   NaN   NaN
b   NaN   5.0   7.0   9.0   NaN
c   NaN  13.0  15.0  17.0   NaN
d   NaN   NaN   NaN   NaN   NaN

In [10]:
X1.add(X2,fill_value= 200)

    col1   col2   col3   col4   col5
a  200.0  201.0  202.0  203.0    NaN
b  204.0    5.0    7.0    9.0  203.0
c  208.0   13.0   15.0   17.0  207.0
d    NaN  208.0  209.0  210.0  211.0

In [13]:
X1 = pd.DataFrame(np.arange(12).reshape(3,4),index =['a','b','c'],columns = ['col1','col2','col3','col4'])
X2= pd.DataFrame(np.arange(10,22).reshape(3,4),index =['a','b','c'],columns = ['col1','col2','col3','col4'])

print(X1,X2,X1.sub(X2),X1.rsub(X2),sep='\n\n')

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11

   col1  col2  col3  col4
a    10    11    12    13
b    14    15    16    17
c    18    19    20    21

   col1  col2  col3  col4
a   -10   -10   -10   -10
b   -10   -10   -10   -10
c   -10   -10   -10   -10

   col1  col2  col3  col4
a    10    10    10    10
b    10    10    10    10
c    10    10    10    10

# Functtion mapping in pandas

In [14]:
X1 = pd.DataFrame(np.arange(12).reshape(3,4),index =['a','b','c'],columns = ['col1','col2','col3','col4'])
X1

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11

In [16]:
#using the apply function
X2 = X1.apply(lambda x: x*100)
X2

   col1  col2  col3  col4
a     0   100   200   300
b   400   500   600   700
c   800   900  1000  1100

In [34]:
# getting the maximum value for each of the columns
def fn(x):
    return (pd.Series([max(x),min(x),sum(x)], index = ["max","min","sum"]))
           
X2 = X1.apply(fn) # column wise
X3 =X1.apply(fn,axis=1) # for row
print(X1,X2,X3,sep = "\n\n")

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11

     col1  col2  col3  col4
max     8     9    10    11
min     0     1     2     3
sum    12    15    18    21

   max  min  sum
a    3    0    6
b    7    4   22
c   11    8   38

In [45]:
# using apply_map function
def fn(x):
    return x*10

X2 = X1.applymap(fn)
print(X1,X2,sep="\n\n")

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11

   col1  col2  col3  col4
a     0    10    20    30
b    40    50    60    70
c    80    90   100   110

# Sorting and ranking

In [49]:
X = pd.DataFrame([[50,3,30],[100,3,300],[40,30,4],[30,30,5]],index =['b','a','c','d'],columns = ['col2','col1','col3'])
X

   col2  col1  col3
b    50     3    30
a   100     3   300
c    40    30     4
d    30    30     5

In [50]:
#sorting the rows
X.sort_index()

   col2  col1  col3
a   100     3   300
b    50     3    30
c    40    30     4
d    30    30     5

In [51]:
#sorting the columns
X.sort_index(axis = 1)

   col1  col2  col3
b     3    50    30
a     3   100   300
c    30    40     4
d    30    30     5

In [53]:
# sorting values
X.sort_values(by='col2')

   col2  col1  col3
d    30    30     5
c    40    30     4
b    50     3    30
a   100     3   300

In [54]:
# sorting multiple values
X.sort_values(by=['col1','col3'])

   col2  col1  col3
b    50     3    30
a   100     3   300
c    40    30     4
d    30    30     5

In [55]:
#using the rank function
X.rank()#for columns  #fow rows x.rank(axis=1)

   col2  col1  col3
b   3.0   1.5   3.0
a   4.0   1.5   4.0
c   2.0   3.5   1.0
d   1.0   3.5   2.0

# summarizing data

In [56]:
X = pd.DataFrame(np.random.rand(8,5),columns = ['a','b','c','d','e'])
X

          a         b         c         d         e
0  0.312338  0.318317  0.164300  0.366435  0.902090
1  0.424939  0.776636  0.098676  0.178128  0.906327
2  0.551192  0.223387  0.716548  0.308975  0.564811
3  0.626271  0.476044  0.504241  0.126299  0.220228
4  0.708511  0.589053  0.174899  0.834135  0.163949
5  0.314149  0.782387  0.941910  0.079844  0.338502
6  0.479575  0.972163  0.513006  0.587969  0.730601
7  0.947686  0.955264  0.828549  0.059262  0.854670

In [57]:
# describing the data
X.describe()

              a         b         c         d         e
count  8.000000  8.000000  8.000000  8.000000  8.000000
mean   0.545583  0.636656  0.492766  0.317631  0.585147
std    0.214360  0.281603  0.322786  0.272994  0.309199
min    0.312338  0.223387  0.098676  0.059262  0.163949
25%    0.397241  0.436612  0.172249  0.114685  0.308933
50%    0.515383  0.682844  0.508624  0.243552  0.647706
75%    0.646831  0.825606  0.744548  0.421819  0.866525
max    0.947686  0.972163  0.941910  0.834135  0.906327

In [58]:
# calculating the individual values
print(X.mean(),X.sum(),sep='\n\n')

a    0.545583
b    0.636656
c    0.492766
d    0.317631
e    0.585147
dtype: float64

a    4.364660
b    5.093250
c    3.942129
d    2.541047
e    4.681177
dtype: float64

In [59]:
# calculating the individual values row wise
print(X.mean(axis=1),X.sum(axis=1),sep='\n\n')

0    0.412696
1    0.476941
2    0.472983
3    0.390616
4    0.494109
5    0.491358
6    0.656663
7    0.729086
dtype: float64

0    2.063480
1    2.384706
2    2.364913
3    1.953082
4    2.470547
5    2.456792
6    3.283313
7    3.645432
dtype: float64

In [60]:
X.corr()

          a         b         c         d         e
a  1.000000  0.252207  0.215311  0.018089 -0.118546
b  0.252207  1.000000  0.234853 -0.095914  0.213056
c  0.215311  0.234853  1.000000 -0.514647 -0.175865
d  0.018089 -0.095914 -0.514647  1.000000 -0.251421
e -0.118546  0.213056 -0.175865 -0.251421  1.000000

In [62]:
X.cov()

          a         b         c         d         e
a  0.045950  0.015224  0.014898  0.001059 -0.007857
b  0.015224  0.079300  0.021348 -0.007374  0.018551
c  0.014898  0.021348  0.104191 -0.045350 -0.017552
d  0.001059 -0.007374 -0.045350  0.074526 -0.021222
e -0.007857  0.018551 -0.017552 -0.021222  0.095604

In [66]:
# finding the corrlation between two columns
X['a'].corr(X["b"])

0.25220655273529635

In [67]:
# finding the covariance of two column
X['a'].cov(X["b"])

0.015224298593182797

In [69]:
# using the idx function
print(X,X.idxmax(),X.idxmax(axis=1),sep = "\n\n")

          a         b         c         d         e
0  0.312338  0.318317  0.164300  0.366435  0.902090
1  0.424939  0.776636  0.098676  0.178128  0.906327
2  0.551192  0.223387  0.716548  0.308975  0.564811
3  0.626271  0.476044  0.504241  0.126299  0.220228
4  0.708511  0.589053  0.174899  0.834135  0.163949
5  0.314149  0.782387  0.941910  0.079844  0.338502
6  0.479575  0.972163  0.513006  0.587969  0.730601
7  0.947686  0.955264  0.828549  0.059262  0.854670

a    7
b    6
c    5
d    4
e    1
dtype: int64

0    e
1    e
2    c
3    a
4    d
5    c
6    b
7    b
dtype: object

In [10]:
import pandas as pd
D = {"product":{"0":'product1',"1":'product2',"2":'product3',"3":'product4',"4":'product5'},
      "price":{"0":100,"1":200,"2":300,"3":400,"4":500},
      "size" :{"0":'Big',"1":'Medium',"2":'Small',"3":'Medium',"4":'Big'},
      "Discount(%)":{"0":10,"1":20,"2":30,"3":40,"4":50}
     }
X = pd.DataFrame(D,columns = ["product","size","price","Discount"])
X.index.name = "product Index"
X.columns.name = "product details"
X["price < 300"] = X.price<300
print(X)

product details   product    size  price Discount  price < 300
product Index
0                product1     Big    100      NaN         True
1                product2  Medium    200      NaN         True
2                product3   Small    300      NaN        False
3                product4  Medium    400      NaN        False
4                product5     Big    500      NaN        False

In [54]:
import numpy as np
X = pd.DataFrame(np.random.rand(4,4),index =['a','b','c','d'],columns=['a','b','c','d'])
print(X)

          a         b         c         d
a  0.220698  0.351659  0.726019  0.783907
b  0.089519  0.539816  0.489525  0.421207
c  0.156953  0.137483  0.898294  0.813908
d  0.179295  0.060484  0.425034  0.688401

In [65]:
X.loc[:, 'a':'c'][X.a>0.07][X.b>0.04]

          a         b         c
a  0.220698  0.351659  0.726019
b  0.089519  0.539816  0.489525
c  0.156953  0.137483  0.898294
d  0.179295  0.060484  0.425034

In [74]:
X =pd.DataFrame(np.arange(16).reshape(4,4),index = ['a','b','c','d'],columns = ['a1','b1','c1','d1'])
Y = pd.DataFrame(np.arange(6).reshape(3,2),index = ['a','b','c'],columns = ['a1','b1'])

In [75]:
print(X.add(Y, fill_value=100))

      a1     b1     c1     d1
a    0.0    2.0  102.0  103.0
b    6.0    8.0  106.0  107.0
c   12.0   14.0  110.0  111.0
d  112.0  113.0  114.0  115.0

In [110]:
X =pd.DataFrame(np.arange(16).reshape(4,4),index = ['d','b','c','a'],columns = ['d1','b1','c1','a1'])
X.index[0] = 'e'

TypeError: Index does not support mutable operations

In [103]:
X = pd.DataFrame([[2,2,4,5],[20,20,4,50],[40,50,10,5],[10,10,10,50]],index = ['d','b','c','a'],columns = ['d1','b1','c1','a1'])

In [104]:
print(X.sort_values(by=['a1','b1']))

   d1  b1  c1  a1
d   2   2   4   5
c  40  50  10   5
a  10  10  10  50
b  20  20   4  50